examples/convergentDivergent/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
//*******This file is generated by Venturial*********//
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	object      blockMeshDict;
}
convertToMeters 1;
vertices
(
	( -1.47 3.0 -1.47 )
	( -1.47 3.0 1.47 )
	( 1.0 1.0 -1.0 )
	( 1.47 3.0 -1.47 )
	( 1.47 3.0 1.47 )
	( -1.0 -1.0 1.0 )
	( -1.0 1.0 -1.0 )
	( -1.0 1.0 1.0 )
	( 1.0 1.0 1.0 )
	( -2.16 -5.0 -2.16 )
	( -2.16 -5.0 2.16 )
	( -1.0 -1.0 -1.0 )
	( 2.16 -5.0 -2.16 )
	( 2.16 -5.0 2.16 )
	( 1.0 -1.0 -1.0 )
	( 1.0 -1.0 1.0 )
);
blocks
(
	hex ( 11 14 2 6 5 15 8 7 ) ( 20 20 20 ) simpleGrading (1 1 1)
	hex ( 6 2 3 0 7 8 4 1 ) ( 20 20 20 ) simpleGrading (1 1 1)
	hex ( 9 12 14 11 10 13 15 5 ) ( 20 20 20 ) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
	outlet
	{
		type patch;
		faces
		(
			( 12 13 10 9 )
		);
	}
	inlet
	{
		type patch;
		faces
		(
			( 0 1 4 3 )
		);
	}
	fixedWalls
	{
		type wall;
		faces
		(
			( 6 7 1 0 )
			( 3 4 8 2 )
			( 0 3 2 6 )
			( 4 1 7 8 )
			( 11 5 7 6 )
			( 2 8 15 14 )
			( 6 2 14 11 )
			( 8 7 5 15 )
			( 9 10 5 11 )
			( 14 15 13 12 )
			( 11 14 12 9 )
			( 15 5 10 13 )
		);
	}
);
mergePatchPairs
(
);
// ************************************************************************* //
